urzino/FanMonitoringBlueCoin/STM32CubeFunctionPack_ALLMEMS1_V3.2.0/Drivers/BSP/X-NUCLEO-CCA02M1/x_nucleo_cca02m1_audio_f4.c
/**
******************************************************************************
* @file    x_nucleo_cca02m1_audio_f4.c
* @author  Central Labs
* @version V2.0.0
* @date    06-March-2017
* @brief   This file provides the Audio driver for the X-NUCLEO-CCA02M1
*          expansion board
*******************************************************************************
* @attention
*
* <h2><center>&copy; COPYRIGHT(c) 2014 STMicroelectronics</center></h2>
*
* Redistribution and use in source and binary forms, with or without modification,
* are permitted provided that the following conditions are met:
*   1. Redistributions of source code must retain the above copyright notice,
*      this list of conditions and the following disclaimer.
*   2. Redistributions in binary form must reproduce the above copyright notice,
*      this list of conditions and the following disclaimer in the documentation
*      and/or other materials provided with the distribution.
*   3. Neither the name of STMicroelectronics nor the names of its contributors
*      may be used to endorse or promote products derived from this software
*      without specific prior written permission.
*
* THIS SOFTWARE IS PROVIDED BY THE COPYRIGHT HOLDERS AND CONTRIBUTORS "AS IS"
* AND ANY EXPRESS OR IMPLIED WARRANTIES, INCLUDING, BUT NOT LIMITED TO, THE
* IMPLIED WARRANTIES OF MERCHANTABILITY AND FITNESS FOR A PARTICULAR PURPOSE ARE
* DISCLAIMED. IN NO EVENT SHALL THE COPYRIGHT HOLDER OR CONTRIBUTORS BE LIABLE
* FOR ANY DIRECT, INDIRECT, INCIDENTAL, SPECIAL, EXEMPLARY, OR CONSEQUENTIAL
* DAMAGES (INCLUDING, BUT NOT LIMITED TO, PROCUREMENT OF SUBSTITUTE GOODS OR
* SERVICES; LOSS OF USE, DATA, OR PROFITS; OR BUSINESS INTERRUPTION) HOWEVER
* CAUSED AND ON ANY THEORY OF LIABILITY, WHETHER IN CONTRACT, STRICT LIABILITY,
* OR TORT (INCLUDING NEGLIGENCE OR OTHERWISE) ARISING IN ANY WAY OUT OF THE USE
* OF THIS SOFTWARE, EVEN IF ADVISED OF THE POSSIBILITY OF SUCH DAMAGE.
*
******************************************************************************
*/

/* Includes ------------------------------------------------------------------*/
#include "stm32f4xx_hal.h"
#include "x_nucleo_cca02m1_audio_f4.h"

/** @addtogroup BSP
* @{
*/

/** @addtogroup X-NUCLEO-CCA02M1
* @{
*/

/** @addtogroup X-NUCLEO-CCA02M1_AUDIO_F4
* @brief This file provides set of firmware functions to manage MEMS microphones
*        initialization on STM32F4xx-Nucleo Kit from STMicroelectronics.
* @{
*/

/** @defgroup X-NUCLEO-CCA02M1_AUDIO_F4_Private_Types
* @{
*/

/**
* @}
*/

/** @defgroup X-NUCLEO-CCA02M1_AUDIO_F4_Private_Defines 
* @{
*/

/**
* @}
*/

/** @defgroup X-NUCLEO-CCA02M1_AUDIO_F4_Private_Macros 
* @{
*/

/**
* @}
*/

/** @defgroup X-NUCLEO-CCA02M1_AUDIO_F4_Private_Variables
* @{
*/
#define CHANNEL_DEMUX_MASK                    	0x55


I2S_HandleTypeDef                 hAudioInI2s;
SPI_HandleTypeDef                 hAudioInSPI;

static TIM_HandleTypeDef          TimDividerHandle;
static TIM_SlaveConfigTypeDef     sSlaveConfig;
static TIM_IC_InitTypeDef         sICConfig;
static TIM_OC_InitTypeDef         sOCConfig;

static X_NUCLEO_CCA02M1_HandlerTypeDef X_NUCLEO_CCA02M1_Handler;

static uint16_t I2S_InternalBuffer[PDM_INTERNAL_BUFFER_SIZE_I2S];
static uint16_t SPI_InternalBuffer[PDM_INTERNAL_BUFFER_SIZE_SPI];

static uint16_t AudioInVolume = 64;
static PDMFilter_InitStruct Filter[4];

#ifdef USE_ARM_DECIMATION
/*This is required to achieve a decimation greater than 128
It's used for the 8KHz fs*/
#include "arm_math.h"
static int16_t aCoeffs[] = { -1406, 1634, -1943, 2386, -3080, 4325, -7223, 21690, 21690, -7223, 4325, -3080, 2386, -1943, 1634, -1406, };
#define DECIMATOR_NUM_TAPS 16
#define DECIMATOR_BLOCK_SIZE 16 
#define DECIMATOR_FACTOR 2
#define DECIMATOR_STATE_LENGTH (DECIMATOR_BLOCK_SIZE + (DECIMATOR_NUM_TAPS) -1)
static arm_fir_decimate_instance_q15 ARM_Decimator_State[4];
static int16_t aState_ARM[4][DECIMATOR_STATE_LENGTH];
#endif

uint8_t Channel_Demux[128] = {
  0x00, 0x01, 0x00, 0x01, 0x02, 0x03, 0x02, 0x03,
  0x00, 0x01, 0x00, 0x01, 0x02, 0x03, 0x02, 0x03,
  0x04, 0x05, 0x04, 0x05, 0x06, 0x07, 0x06, 0x07,
  0x04, 0x05, 0x04, 0x05, 0x06, 0x07, 0x06, 0x07,
  0x00, 0x01, 0x00, 0x01, 0x02, 0x03, 0x02, 0x03,
  0x00, 0x01, 0x00, 0x01, 0x02, 0x03, 0x02, 0x03,
  0x04, 0x05, 0x04, 0x05, 0x06, 0x07, 0x06, 0x07,
  0x04, 0x05, 0x04, 0x05, 0x06, 0x07, 0x06, 0x07,
  0x08, 0x09, 0x08, 0x09, 0x0a, 0x0b, 0x0a, 0x0b,
  0x08, 0x09, 0x08, 0x09, 0x0a, 0x0b, 0x0a, 0x0b,
  0x0c, 0x0d, 0x0c, 0x0d, 0x0e, 0x0f, 0x0e, 0x0f,
  0x0c, 0x0d, 0x0c, 0x0d, 0x0e, 0x0f, 0x0e, 0x0f,
  0x08, 0x09, 0x08, 0x09, 0x0a, 0x0b, 0x0a, 0x0b,
  0x08, 0x09, 0x08, 0x09, 0x0a, 0x0b, 0x0a, 0x0b,
  0x0c, 0x0d, 0x0c, 0x0d, 0x0e, 0x0f, 0x0e, 0x0f,
  0x0c, 0x0d, 0x0c, 0x0d, 0x0e, 0x0f, 0x0e, 0x0f
};


/**
* @}
*/

/** @defgroup X-NUCLEO-CCA02M1_AUDIO_F4_Private_Function_Prototypes 
* @{
*/

static uint8_t AUDIO_IN_Timer_Init(void);
static uint8_t AUDIO_IN_Timer_Start(void);
static void AUDIO_IN_I2S_MspInit(void);
static void AUDIO_IN_SPI_MspInit(void);
/**
* @}
*/

/** @defgroup X-NUCLEO-CCA02M1_AUDIO_F4_Exported_Functions 
* @{
*/

/**
* @brief  Initializes audio acquisition recording.
* @param  AudioFreq: Audio frequency to be configured for the peripherals.
* 		  Possible values are 8000, 16000, 32000 or 48000 Hz
* @param  BitRes: Not used.
* @param  ChnlNbr: Number of channels to be recorded.
* @retval AUDIO_OK in case of success, AUDIO_ERROR otherwise 
*/
__weak uint8_t BSP_AUDIO_IN_Init(uint32_t AudioFreq, uint32_t BitRes, uint32_t ChnlNbr)
{
   
  /*Set Structure for internal state*/
  X_NUCLEO_CCA02M1_Handler.MicChannels = ChnlNbr;
  
  switch (AudioFreq)
  {
  case AUDIO_IN_FS_8000:
    X_NUCLEO_CCA02M1_Handler.PDM_Clock_Freq = 1280; /*KHz*/
    X_NUCLEO_CCA02M1_Handler.PCM_Sampling_Freq = 8000;
    
    break;
    
  case AUDIO_IN_FS_16000:
    X_NUCLEO_CCA02M1_Handler.PDM_Clock_Freq = PDM_FREQ_16K; /*KHz*/
    X_NUCLEO_CCA02M1_Handler.PCM_Sampling_Freq = 16000;
    break;
    
  case AUDIO_IN_FS_32000:
    X_NUCLEO_CCA02M1_Handler.PDM_Clock_Freq = 2048; /*KHz*/
    X_NUCLEO_CCA02M1_Handler.PCM_Sampling_Freq = 32000;
    break;
    
  case AUDIO_IN_FS_48000:
    X_NUCLEO_CCA02M1_Handler.PDM_Clock_Freq = 3072; /*KHz*/
    X_NUCLEO_CCA02M1_Handler.PCM_Sampling_Freq = 48000;
    break;
  default:
    return AUDIO_ERROR;
  }
  
  
  X_NUCLEO_CCA02M1_Handler.DecimationFactor = (X_NUCLEO_CCA02M1_Handler.PDM_Clock_Freq * 1000) /
    X_NUCLEO_CCA02M1_Handler.PCM_Sampling_Freq;
  X_NUCLEO_CCA02M1_Handler.PdmBufferSize = (X_NUCLEO_CCA02M1_Handler.PDM_Clock_Freq / 8) * 2 * N_MS_PER_INTERRUPT;
  
  uint16_t PDM_I2S_Clock = X_NUCLEO_CCA02M1_Handler.PDM_Clock_Freq;
  
  if (X_NUCLEO_CCA02M1_Handler.MicChannels > 1)
  {
    PDM_I2S_Clock *= 2;  /*Clock to be generated is twice the PDM clock */
    /*Timer Init*/
    if (AUDIO_IN_Timer_Init() != AUDIO_OK)
    {
      return AUDIO_ERROR;
    }
  }
  
